In [10]:
import pandas as pd

d1 = {
  'customer_id': [1, 2, 3, 4, 5, 6],
  'product': ['Oven', 'Oven', 'Oven', 'Television', 'Television', 'Television']
}

df1 = pd.DataFrame(d1)

d2 = {
  'customer_id': [2, 4, 6, 8],
  'state': ['California', 'California', 'Texas', 'Hell']
}

df2 = pd.DataFrame(d2)

In [11]:
print(df1)
print()
print(df2)

   customer_id     product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

   customer_id       state
0            2  California
1            4  California
2            6       Texas
3            8        Hell

In [12]:
inner_join_result = pd.merge(df1, df2, on='customer_id', how='inner')
inner_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [13]:
inner_join_result = df1.merge(df2, on='customer_id', how='inner')
inner_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [14]:
left_join_result = df1.merge(df2, on='customer_id', how='left')
left_join_result

   customer_id     product       state
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [16]:
right_join_result = df1.merge(df2, on='customer_id', how='right')
right_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas
3            8         NaN        Hell

In [18]:
left_join_result = df2.merge(df1, on='customer_id', how='left')
left_join_result

   customer_id       state     product
0            2  California        Oven
1            4  California  Television
2            6       Texas  Television
3            8        Hell         NaN

In [19]:
full_outer_join_result = pd.merge(df1, df2, on='customer_id', how='outer')
full_outer_join_result

   customer_id     product       state
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas
6            8         NaN        Hell